<p>Что покажет приведенный ниже фрагмент кода</p>

<pre><code class="language-python">n = 3
list1 = []

for _ in range(n):
    row = input().split()
    list1.extend(row)

print(list1)</code></pre>

<p>если на вход программе подаются строки:</p>

<pre><code class="language-no-highlight">9 7 6
2 1
3 4 45 67</code></pre>